app/views/welcome/_question.html.erb

SELECT COUNT(*) FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 75]]
---
  <div class="questionsummary question-answers">
    <%=question.answers.count%>

SELECT "tags".* FROM "tags" INNER JOIN "question_tags" ON "tags"."id" = "question_tags"."tag_id" WHERE "question_tags"."question_id" = $1  [["question_id", 75]]
---
  <div class ="questionsummary question-tags question-group">
    <% question.tags.each do |tag| %>