app/views/tags/show.html.erb

SELECT "questions".* FROM "questions" INNER JOIN "question_tags" ON "questions"."id" = "question_tags"."question_id" WHERE "question_tags"."tag_id" = $1  [["tag_id", 262]]
SELECT COUNT(*) FROM "questions" INNER JOIN "question_tags" ON "questions"."id" = "question_tags"."question_id" WHERE "question_tags"."tag_id" = $1  [["tag_id", 262]]
---
<% if @tag.questions.count == 1 %>