app/controllers/votes_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 75]]
DELETE FROM "votes" WHERE "votes"."id" = $1  [["id", 118]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."votable_id" = $2 AND "votes"."votable_type" = $3  ORDER BY "votes"."id" ASC LIMIT 1  [["user_id", 100], ["votable_id", 75], ["votable_type", "Question"]]
INSERT INTO "votes" ("user_id", "upvote?", "votable_id", "votable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 100], ["upvote?", "f"], ["votable_id", 75], ["votable_type", "Question"], ["created_at", "2015-07-13 12:47:47.824658"], ["updated_at", "2015-07-13 12:47:47.824658"]]
---
  def questionvotes
    question = Question.find_by(id: params[:question_id])
    if user_has_made_this_vote(question, params[:question_id])
      flash[:notice] = "You have already made that vote"
      redirect_to :back
    elsif user_previosly_voted_differently(question, params[:upvote?])
      current_user.votes.where(votable_id: question.id, votable_type: 'Question').first.delete
      question.votes.create(user_id: current_user.id, upvote?: params[:upvote?])

SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 29]]
DELETE FROM "votes" WHERE "votes"."id" = $1  [["id", 119]]
SELECT  "votes".* FROM "votes" WHERE "votes"."user_id" = $1 AND "votes"."votable_id" = $2 AND "votes"."votable_type" = $3  ORDER BY "votes"."id" ASC LIMIT 1  [["user_id", 100], ["votable_id", 29], ["votable_type", "Answer"]]
INSERT INTO "votes" ("user_id", "upvote?", "votable_id", "votable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 100], ["upvote?", "t"], ["votable_id", 29], ["votable_type", "Answer"], ["created_at", "2015-07-13 12:59:02.290240"], ["updated_at", "2015-07-13 12:59:02.290240"]]
---
  def answervotes
    answer = Answer.find_by(id: params[:answer_id])
    if user_has_made_this_vote(answer, params[:upvote?])
      flash[:notice] = "You have already made that vote"
      redirect_to :back
    elsif user_previosly_voted_differently(answer, params[:upvote?])
      current_user.votes.where(votable_id: answer.id, votable_type: 'Answer').first.delete
      current_user.votes.where(votable_id: answer.id, votable_type: "Answer")
      answer.votes.create(user_id: current_user.id, upvote?: params[:upvote?])