app/controllers/welcome_controller.rb

SELECT  "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "questions"
---
  def index
    @questions = Question.order(created_at: :desc).page(params[:page])